
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьАутентификациюОС(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьАутентификациюОС(Команда)
	WSH = Новый COMobject("wscript.shell");
	Домен = WSH.ExpandEnvironmentStrings("%USERDOMAIN%");
	Пользователь = WSH.ExpandEnvironmentStrings("%USERNAME%");
	ПользовательОС = СтрШаблон("\\%1\%2", Домен, Пользователь);
	УстановитьАутентификациюОСНаСервере(ПользовательОС);
	ЗавершитьРаботуСистемы();
КонецПроцедуры

&НаСервере
Процедура УстановитьАутентификациюОСНаСервере(ПользовательОС)
	Пользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	Если Пользователь <> Неопределено Тогда
		Пользователь.АутентификацияОС = Истина;
		Пользователь.ПользовательОС = ПользовательОС;
		Пользователь.Записать();
	КонецЕсли;
КонецПроцедуры
