
#Область ПрограммныйИнтерфейс

Функция RunQuery(Text, Params = Неопределено) Экспорт
	Результат = Новый Структура("IsArray,Value,RowCount,ColumnCount,Duration", Ложь, 0, 0, 0);
	ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Если Не ЗначениеЗаполнено(Text) Тогда
		ВызватьИсключение "Отсутствует текст запроса";
	КонецЕсли;
	Если Params <> Неопределено Тогда
		Параметры = Params.Выгрузить();
	КонецЕсли;
	СтруктураПараметры = Новый Структура();
	Если Параметры <> Неопределено Тогда
		Для ё = 0 по Параметры.Количество() - 1 Цикл
			Если ё % 2 = 0 Тогда
				Параметр = Параметры[ё];
				Значение = Параметры[ё + 1];
				СтруктураПараметры.Вставить(Параметр, Значение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	РезультатЗапроса = YQ_OLEAutomationServerCall.ВыполнитьЗапрос(Text, СтруктураПараметры);
	Результат.ColumnCount = РезультатЗапроса.Количество();
	Если Результат.ColumnCount > 0 Тогда
		Результат.RowCount = РезультатЗапроса[0].Количество();
	КонецЕсли;
	Если Результат.RowCount > 1 или Результат.ColumnCount > 1 Тогда
		COMSafeArray = Новый COMSafeArray(РезультатЗапроса, "VT_VARIANT");
		Результат.IsArray = Истина;
		Результат.Value = COMSafeArray;
	ИначеЕсли Результат.RowCount = 1 Тогда
		Результат.Value = РезультатЗапроса[0][0];
	КонецЕсли;
	ВремяОкончания = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Длительность = (ВремяОкончания - ВремяНачала) / 1000;
	Результат.Duration = Длительность;
	Возврат Результат;
КонецФункции

Функция GetURLPresentation(URL) Экспорт
	Ссылка = YQ_OLEAutomationServerCall.ПолучитьСсылкуПоURL(URL);
	Результат = Строка(Ссылка);
	Возврат Результат;
КонецФункции

Функция GetURLAttribute(URL, AttributeName) Экспорт
	Результат = YQ_OLEAutomationServerCall.ПолучитьРеквизитСсылкиПоURL(URL, AttributeName);
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область ДополнительныеПроцедурыИФункции

#КонецОбласти
