
#Область ПрограммныйИнтерфейс

Функция RunQuery(Text, Params = Неопределено) Экспорт
	Результат = Новый Структура("IsArray,Value,RowCount,ColumnCount", Ложь, 0, 0, 0);
	Если Не ЗначениеЗаполнено(Text) Тогда
		ВызватьИсключение "Отсутствует текст запроса";
	КонецЕсли;
	Если Params <> Неопределено Тогда
		Параметры = Params.Выгрузить();
	КонецЕсли;
	СтруктураПараметры = Новый Структура();
	Если Параметры <> Неопределено Тогда
		Для ё = 0 по Параметры.Количество() - 1 Цикл
			Если ё % 2 = 0 Тогда
				Параметр = Параметры[ё];
				Значение = Параметры[ё + 1];
				СтруктураПараметры.Вставить(Параметр, Значение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	РезультатЗапроса = YQ_OLEAutomationServerCall.ВыполнитьЗапрос(Text, СтруктураПараметры);
	Результат.RowCount = РезультатЗапроса.Количество();
	Если Результат.RowCount > 0 Тогда
		Результат.ColumnCount = РезультатЗапроса[0].Количество();
	КонецЕсли;
	Если Результат.RowCount > 1 или Результат.ColumnCount > 1 Тогда
		Результат.IsArray = Истина;
		Результат.Value = РезультатЗапроса;
	ИначеЕсли Результат.RowCount = 1 Тогда
		Для Каждого КЗ из РезультатЗапроса[0] Цикл
			Результат.Value = КЗ.Значение;
			Прервать;
		КонецЦикла;
	КонецЕсли;
	Возврат Результат;
КонецФункции

Функция GetURLPresentation(URL) Экспорт
	Ссылка = YQ_OLEAutomationServerCall.ПолучитьСсылкуПоURL(URL);
	Результат = Строка(Ссылка);
	Возврат Результат;
КонецФункции

Функция GetURLProperty(URL, PropertyName) Экспорт
	Результат = YQ_OLEAutomationServerCall.ПолучитьРеквизитСсылкиПоURL(URL, PropertyName);
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область ДополнительныеПроцедурыИФункции

#КонецОбласти
